## Production: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 12 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                   |
|--------|--------------------------------------------------------------------------|
| add    | `module.budget_notifier.aws_cloudwatch_event_rule.daily_budget_spend`    |
|        | `module.budget_notifier.aws_cloudwatch_event_rule.weekly_budget_spend`   |
|        | `module.budget_notifier.aws_cloudwatch_event_target.daily_budget_spend`  |
|        | `module.budget_notifier.aws_cloudwatch_event_target.weekly_budget_spend` |
|        | `module.budget_notifier.aws_cloudwatch_log_group.this`                   |
|        | `module.budget_notifier.aws_iam_policy.spend_notifier`                   |
|        | `module.budget_notifier.aws_iam_role.spend_notifier`                     |
|        | `module.budget_notifier.aws_iam_role_policy_attachment.lambda_insights`  |
|        | `module.budget_notifier.aws_iam_role_policy_attachment.spend_notifier`   |
|        | `module.budget_notifier.aws_lambda_function.spend_notifier`              |
|        | `module.budget_notifier.aws_lambda_permission.allow_daily_budget`        |
|        | `module.budget_notifier.aws_lambda_permission.allow_weekly_budget`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.budget_notifier.aws_cloudwatch_event_rule.daily_budget_spend will be created
  + resource "aws_cloudwatch_event_rule" "daily_budget_spend" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "dailyBudgetSpend"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 12 * * ? *)"
      + tags                = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }

  # module.budget_notifier.aws_cloudwatch_event_rule.weekly_budget_spend will be created
  + resource "aws_cloudwatch_event_rule" "weekly_budget_spend" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "weeklyBudgetSpend"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 12 ? * SUN *)"
      + tags                = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }

  # module.budget_notifier.aws_cloudwatch_event_target.daily_budget_spend will be created
  + resource "aws_cloudwatch_event_target" "daily_budget_spend" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = (sensitive value)
      + rule           = "dailyBudgetSpend"
      + target_id      = (known after apply)
    }

  # module.budget_notifier.aws_cloudwatch_event_target.weekly_budget_spend will be created
  + resource "aws_cloudwatch_event_target" "weekly_budget_spend" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = (sensitive value)
      + rule           = "weeklyBudgetSpend"
      + target_id      = (known after apply)
    }

  # module.budget_notifier.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/spend_notifier"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }

  # module.budget_notifier.aws_iam_policy.spend_notifier will be created
  + resource "aws_iam_policy" "spend_notifier" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "spend_notifier"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:296255494825:*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/spend_notifier:*"
                    },
                  + {
                      + Action   = "ce:GetCostAndUsage"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }

  # module.budget_notifier.aws_iam_role.spend_notifier will be created
  + resource "aws_iam_role" "spend_notifier" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "spend_notifier_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.budget_notifier.aws_iam_role_policy_attachment.lambda_insights will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "spend_notifier_lambda"
    }

  # module.budget_notifier.aws_iam_role_policy_attachment.spend_notifier will be created
  + resource "aws_iam_role_policy_attachment" "spend_notifier" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "spend_notifier_lambda"
    }

  # module.budget_notifier.aws_lambda_function.spend_notifier will be created
  + resource "aws_lambda_function" "spend_notifier" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/main.py.zip"
      + function_name                  = "spend_notifier"
      + handler                        = "spend_notifier.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "KqgaQgrKH72tPtzVxEXFeT0UIdVJmB8W7Q3/O5onycQ="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCOUNT_NAME" = "Notification-production"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # module.budget_notifier.aws_lambda_permission.allow_daily_budget will be created
  + resource "aws_lambda_permission" "allow_daily_budget" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "spend_notifier"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowDailyBudget"
      + statement_id_prefix = (known after apply)
    }

  # module.budget_notifier.aws_lambda_permission.allow_weekly_budget will be created
  + resource "aws_lambda_permission" "allow_weekly_budget" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "spend_notifier"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowWeeklyBudget"
      + statement_id_prefix = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 61 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning[0]"]
WARN - plan.json -...
```

</details>
